wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
            SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);     /* Switch to Normal mode. */
            SPIM_SET_DATA_WIDTH(spim, (rnm * 8UL));
            SPIM_SET_BURST_DATA(spim, 1UL);

            if (SPIM_IsSPIMENDone(spim, 1) == SPIM_ERR_TIMEOUT)
            {
                return SPIM_ERR_TIMEOUT;
            }
        }
    }

    return SPIM_OK;
}

/**
  * @brief      Read data from SPI slave.
  * @param      pu8TxBuf    Receive buffer.
  * @param      u32NRx      Size of receive buffer in bytes.
  * @retval     SPIM_OK          SPIM operation OK.
  * @retval     SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  * @note       This function sets g_SPIM_i32ErrCode to SPIM_TIMEOUT_ERR if waiting SPIM time-out.
  */
static int spim_read(SPIM_T *spim, uint8_t pu8RxBuf[], uint32_t u32NRx)
{
    uint32_t  buf_idx = 0UL;

    while (u32NRx)
    {
        uint32_t dataNum = 0UL;     /* number of words */

        if (u32NRx >= 16UL)
        {
            dataNum = 4UL;
        }
        else if (u32NRx >= 12UL)
        {
            dataNum = 3UL;
        }
        else if (u32NRx >= 8UL)
        {
            dataNum = 2UL;
        }
        else if (u32NRx >= 4UL)
        {
            dataNum = 1UL;
        }

        if (dataNum)
        {
            SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);     /* Switch to Normal mode. */
            SPIM_SET_DATA_WIDTH(spim, 32UL);
            SPIM_SET_BURST_DATA(spim, dataNum);

            if (SPIM_IsSPIMENDone(spim, 1) == SPIM_ERR_TIMEOUT)
            {
                return SPIM_ERR_TIMEOUT;
            }
        }

        while (dataNum)
        {
            uint32_t tmp;

            tmp = spim->RX[dataNum - 1UL];
            memcpy(&pu8RxBuf[buf_idx], &tmp, 4U);
            buf_idx += 4UL;
            dataNum --;
            u32NRx -= 4UL;
        }

        if (u32NRx && (u32NRx < 4UL))
        {
            uint32_t tmp;

            SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);     /* Switch to Normal mode. */
            SPIM_SET_DATA_WIDTH(spim, (u32NRx * 8UL));
            SPIM_SET_BURST_DATA(spim, 1UL);

            if (SPIM_IsSPIMENDone(spim, 1) == SPIM_ERR_TIMEOUT)
            {
                return SPIM_ERR_TIMEOUT;
            }

            tmp = spim->RX[0];
            memcpy(&pu8RxBuf[buf_idx], &tmp, u32NRx);
            buf_idx += u32NRx;
            u32NRx = 0UL;
        }
    }

    return SPIM_OK;
}

/**
  * @brief      Issue Read Status Register #1 command.
  * @param      dataBuf     Receive buffer.
  * @param      u32NRx      Size of receive buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
static void SPIM_ReadStatusRegister(SPIM_T *spim, uint8_t dataBuf[], uint32_t u32NRx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {OPCODE_RDSR};       /* 1-byte Read Status Register #1 command. */

    SPIM_SET_SS_EN(spim, 1);                /* CS activated. */

    SwitchNBitOutput(spim, u32NBit);
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SwitchNBitInput(spim, u32NBit);
    spim_read(spim, dataBuf, u32NRx);

    SPIM_SET_SS_EN(spim, 0);                /* CS deactivated. */
}

/**
  * @brief      Issue Write Status Register #1 command.
  * @param      dataBuf     Transmit buffer.
  * @param      u32NTx      Size of transmit buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
static void SPIM_WriteStatusRegister(SPIM_T *spim, uint8_t dataBuf[], uint32_t u32NTx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {OPCODE_WRSR, 0x00U};        /* 1-byte Write Status Register #1 command + 1-byte data. */

    cmdBuf[1] = dataBuf[0];

    SPIM_SET_SS_EN(spim, 1);                        /* CS activated. */

    SwitchNBitOutput(spim, u32NBit);
    spim_write(spim, cmdBuf, sizeof(cmdBuf));

    SPIM_SET_SS_EN(spim, 0);                        /* CS deactivated. */
}

/**
  * @brief      Issue Read Status Register #2 command.
  * @param      dataBuf     Receive buffer.
  * @param      u32NRx      Size of receive buffer.
 * @param       u32NBit     N-bit transmit/receive.
  * @return     None.
  */
static void SPIM_ReadStatusRegister2(SPIM_T *spim, uint8_t dataBuf[], uint32_t u32NRx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {OPCODE_RDSR2};      /* 1-byte Read Status Register #1 command. */

    SPIM_SET_SS_EN(spim, 1);                /* CS activated. */

    SwitchNBitOutput(spim, u32NBit);
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SwitchNBitInput(spim, u32NBit);
    spim_read(spim, dataBuf, u32NRx);

    SPIM_SET_SS_EN(spim, 0);                /* CS deactivated. */
}

/**
  * @brief      Issue Winbond Write Status Register command. This command write both Status Register-1
  *             and Status Register-2.
  * @param      dataBuf     Transmit buffer.
  * @param      u32NTx      Size of transmit buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
static void SPIM_WriteStatusRegister2(SPIM_T *spim, uint8_t dataBuf[], uint32_t u32NTx, uint32_t u32NBit)
{
    uint8_t cmdBuf[3] = {OPCODE_WRSR, 0U, 0U};

    cmdBuf[1] = dataBuf[0];
    cmdBuf[2] = dataBuf[1];

    SPIM_SET_SS_EN(spim, 1);        /* CS activated. */

    SwitchNBitOutput(spim, u32NBit);
    spim_write(spim, cmdBuf, sizeof(cmdBuf));

    SPIM_SET_SS_EN(spim, 0);        /* CS deactivated. */
}

#if 0  /* not used */
/**
  * @brief      Issue Write Status Register #3 command.
  * @param      dataBuf     Transmit buffer.
  * @param      u32NTx      Size of transmit buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
static void SPIM_WriteStatusRegister3(uint8_t dataBuf[], uint32_t u32NTx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {OPCODE_WRSR3, 0x00U};    /* 1-byte Write Status Register #2 command + 1-byte data. */
    cmdBuf[1] = dataBuf[0];

    SPIM_SET_SS_EN(1);                          /* CS activated. */
    SwitchNBitOutput(u32NBit);
    spim_write(cmdBuf, sizeof(cmdBuf));
    SPIM_SET_SS_EN(0);                          /* CS deactivated. */
}
#endif

/**
  * @brief      Issue Read Config Register #3 command.
  * @param      dataBuf     Receive buffer.
  * @param      u32NRx      Size of receive buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
static void SPIM_ReadStatusRegister3(SPIM_T *spim, uint8_t dataBuf[], uint32_t u32NRx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {OPCODE_RDSR3};              /* 1-byte Read Status Register #1 command. */

    SPIM_SET_SS_EN(spim, 1);                        /* CS activated. */

    SwitchNBitOutput(spim, u32NBit);
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SwitchNBitInput(spim, u32NBit);
    spim_read(spim, dataBuf, u32NRx);

    SPIM_SET_SS_EN(spim, 0);                        /* CS deactivated. */
}

/**
  * @brief      Read Micron MT35X Octal SPI Flash Flag Status Register.
  * @param      spim
  * @param      dataBuf     Receive buffer.
  * @param      u32NRx      Receive Length.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
static void SPIM_ReadMT35XFlagRegister(SPIM_T *spim, uint8_t dataBuf[], uint32_t u32NRx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = {0x70};           /* 1-byte Read Status Register #1 command. */

