wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
    SPIM_SET_SS_EN(spim, 0);            /* CS deactivated. */
}

/** @endcond HIDDEN_SYMBOLS */

/**
  * @brief      Get SPIM serial clock.
  * @return     SPI serial clock.
  * @details    This function calculates the serial clock of SPI in Hz.
  */
uint32_t SPIM_GetSClkFreq(SPIM_T *spim)
{
    uint32_t clkDiv = SPIM_GET_CLOCK_DIVIDER(spim);

    return clkDiv ? SystemCoreClock / (clkDiv * 2U) : SystemCoreClock;
}

/**
  * @brief      Initialize SPIM flash.
  * @param      clrWP       Clear Write Protect or not.
  * @return     0    Success.
  * @return     -1   Unrecognized manufacture ID or failed on reading manufacture ID.
  */
int SPIM_InitFlash(SPIM_T *spim, int clrWP)
{
    uint8_t   idBuf[3];
    uint8_t   cmdBuf[1];
    uint32_t  i;
    int32_t   ret = -1;

    SPIM_SET_SS_ACTLVL(spim, 0);

    /*
     * Because not sure in SPI or QPI mode, do QPI reset and then SPI reset.
     */
    /* QPI Reset Enable */
    cmdBuf[0] = OPCODE_RSTEN;
    SPIM_SET_SS_EN(spim, 1);                          /* CS activated.    */
    SPIM_ENABLE_QUAD_OUTPUT_MODE(spim);               /* 1-bit, Output.   */
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SPIM_SET_SS_EN(spim, 0);                          /* CS deactivated.  */

    /* QPI Reset */
    cmdBuf[0] = OPCODE_RST;
    SPIM_SET_SS_EN(spim, 1);                          /* CS activated.    */
    SPIM_ENABLE_QUAD_OUTPUT_MODE(spim);               /* 1-bit, Output.   */
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SPIM_SET_SS_EN(spim, 0);                          /* CS deactivated.  */

    /* SPI ResetEnable */
    cmdBuf[0] = OPCODE_RSTEN;
    SPIM_SET_SS_EN(spim, 1);                          /* CS activated.    */
    SPIM_ENABLE_SING_OUTPUT_MODE(spim);               /* 1-bit, Output.   */
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SPIM_SET_SS_EN(spim, 0);                          /* CS deactivated.  */

    /* SPI Reset */
    cmdBuf[0] = OPCODE_RST;
    SPIM_SET_SS_EN(spim, 1);                          /* CS activated.    */
    SPIM_ENABLE_SING_OUTPUT_MODE(spim);               /* 1-bit, Output.   */
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SPIM_SET_SS_EN(spim, 0);                          /* CS deactivated.  */

    if (clrWP)
    {
        uint8_t dataBuf[] = {0x00U};

        SPIM_Set_Write_Enable(spim, 1, 1UL);          /* Clear Block Protect. */
        SPIM_WriteStatusRegister(spim, dataBuf, sizeof(dataBuf), 1U);
        SPIM_Wait_Write_Done(spim, 1UL);
    }

    SPIM_ReadJedecId(spim, idBuf, sizeof(idBuf), 1UL);

    /* printf("ID: 0x%x, 0x%x, px%x\n", idBuf[0], idBuf[1], idBuf[2]); */

    for (i = 0UL; i < sizeof(g_Supported_List) / sizeof(g_Supported_List[0]); i++)
    {
        if (idBuf[0] == g_Supported_List[i])
        {
            ret = 0;
        }
    }

    if (ret != 0)
    {
        SPIM_DBGMSG("Flash initialize failed!! 0x%x\n", idBuf[0]);
    }

    return ret;
}

/**
  * @brief      Issue JEDEC ID command.
  * @param      idBuf       ID buffer.
  * @param      u32NRx      Size of ID buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
void SPIM_ODTRReadJedecId(SPIM_T *spim, uint8_t idBuf[], uint32_t u32NRx, uint32_t u32NBit, uint32_t u32DTRMode)
{
    uint8_t cmdBuf[2] = { OPCODE_RDID };    /* 1-byte JEDEC ID command. */
    uint8_t u8CmdSize = 1;
    SPIM_SET_DTR_MODE(spim, u32DTRMode);    /* DTR Activated. */

    SPIM_SET_SS_EN(spim, 1);                /* CS activated. */

    SwitchNBitOutput(spim, u32NBit);

    if (u32DTRMode == 1)
    {
        cmdBuf[0] = OPCODE_RDID;
        cmdBuf[1] = OPCODE_RDID;
        u8CmdSize = 2;
    }

    spim_write(spim, cmdBuf, u8CmdSize);

    SPIM_SET_DTR_MODE(spim, 0);             /* DTR Activated. */
    SwitchNBitOutput(spim, 1);
    cmdBuf[0] = 0x0;
    spim_write(spim, cmdBuf, 1);

    SPIM_SET_DTR_MODE(spim, u32DTRMode);    /* DTR Activated. */
    SwitchNBitInput(spim, u32NBit);
    spim_read(spim, idBuf, u32NRx);
    SPIM_SET_SS_EN(spim, 0);                /* CS deactivated. */

    SPIM_SET_DTR_MODE(spim, 0); /* DTR Activated. */
}


/**
  * @brief      Issue JEDEC ID command.
  * @param      idBuf       ID buffer.
  * @param      u32NRx      Size of ID buffer.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
void SPIM_ReadJedecId(SPIM_T *spim, uint8_t idBuf[], uint32_t u32NRx, uint32_t u32NBit)
{
    uint8_t cmdBuf[] = { OPCODE_RDID }; /* 1-byte JEDEC ID command. */

    SPIM_SET_SS_EN(spim, 1);            /* CS activated. */

    SwitchNBitOutput(spim, u32NBit);
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SwitchNBitInput(spim, u32NBit);
    spim_read(spim, idBuf, u32NRx);

    SPIM_SET_SS_EN(spim, 0);            /* CS deactivated. */
}

/** @cond HIDDEN_SYMBOLS */

static void spim_enable_spansion_quad_mode(SPIM_T *spim, int isEn)
{
    uint8_t cmdBuf[3];
    uint8_t dataBuf[1], status1;

    cmdBuf[0] = 0x5U;                            /* Read Status Register-1 */

    SPIM_SET_SS_EN(spim, 1);
    SwitchNBitOutput(spim, 1UL);
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SwitchNBitInput(spim, 1UL);
    spim_read(spim, dataBuf, sizeof(dataBuf));
    SPIM_SET_SS_EN(spim, 0);
    /* SPIM_DBGMSG("SR1 = 0x%x\n", dataBuf[0]); */

    status1 = dataBuf[0];

    cmdBuf[0] = 0x35U;                           /* Read Configuration Register-1 */

    SPIM_SET_SS_EN(spim, 1);
    SwitchNBitOutput(spim, 1UL);
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SwitchNBitInput(spim, 1UL);
    spim_read(spim, dataBuf, sizeof(dataBuf));
    SPIM_SET_SS_EN(spim, 0);
    /* SPIM_DBGMSG("CR1 = 0x%x\n", dataBuf[0]); */

    SPIM_Set_Write_Enable(spim, 1, 1UL);

    cmdBuf[0] =  0x1U;                           /* Write register */
    cmdBuf[1] =  status1;

    if (isEn)
    {
        cmdBuf[2] = dataBuf[0] | 0x2U;           /* set QUAD */
    }
    else
    {
        cmdBuf[2] = dataBuf[0] & ~0x2U;          /* clear QUAD */
    }

    SPIM_SET_SS_EN(spim, 1);
    SwitchNBitOutput(spim, 1UL);
    spim_write(spim, cmdBuf, 3UL);
    SPIM_SET_SS_EN(spim, 0);

    SPIM_Set_Write_Enable(spim, 0, 1UL);


    cmdBuf[0] = 0x35U;                           /* Read Configuration Register-1 */

    SPIM_SET_SS_EN(spim, 1);
    SwitchNBitOutput(spim, 1UL);
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SwitchNBitInput(spim, 1UL);
    spim_read(spim, dataBuf, sizeof(dataBuf));
    SPIM_SET_SS_EN(spim, 0);

    /* SPIM_DBGMSG("CR1 = 0x%x\n", dataBuf[0]); */
    N_delay(10000);
}

/** @endcond HIDDEN_SYMBOLS */

/**
  * @brief      Set Wrap Around Enable/disable.
  * @param      isEn        Enable/disable.
  * @param      u32NBit     N-bit transmit/receive.
  * @return     None.
  */
int SPIM_SetWrapAroundEnable(SPIM_T *spim, int isEn, uint32_t u32WaBit)
{
    uint32_t u32CmdBuf[2] = {0x00000000, 0x11011101};

    SPIM_SetQuadEnable(spim, 1, 1);

    SPIM_SET_SS_EN(spim, 1);

    spim->TX[0] = (u32CmdBuf[0] | (1 << 28));

    if (isEn == 1)
    {
        spim->TX[0] = ((u32CmdBuf[0] & ~(1 << 28)) | (1 << 29));
    }

    spim->TX[1] = 0x11011101;

    SwitchNBitOutput(spim, 4UL);
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);    /* Switch to Normal mode. */
    SPIM_SET_DATA_WIDTH(spim, 32UL);
    SPIM_SET_BURST_DATA(spim, 2);

    if (SPIM_IsSPIMENDone(spim, 1) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    SPIM_SET_SS_EN(spim, 0);

    SPIM_SetQuadEnable(spim, 0, 1);

