wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
        case MFGID_ISSI:
            isSupt = (idBuf[2] < 0x49U) ? 0L : 1L;
            break;

        case MFGID_SPANSION:
            SPIM_SPANSION_4Bytes_Enable(spim, isEn, u32NBit);
            isSupt = 1L;
            ret = 0L;
            break;

        case MFGID_MICRON:
            SPIM_Set_Write_Enable(spim, 1, 1);
            isSupt = 1;
            break;

        default:
            break;
    }

    if ((isSupt) && (idBuf[0] != MFGID_SPANSION))
    {
        cmdBuf[0] = isEn ? OPCODE_EN4B : OPCODE_EX4B;

        SPIM_SET_DTR_MODE(spim, u32DTRMode); /* DTR Activated. */

        SPIM_SET_SS_EN(spim, 1);                      /* CS activated.    */
        SwitchNBitOutput(spim, u32NBit);
        spim_write(spim, cmdBuf, sizeof(cmdBuf));
        SPIM_SET_SS_EN(spim, 0);                      /* CS deactivated.  */

        /*
         * FIXME: Per test, 4BYTE Indicator bit doesn't set after EN4B, which
         * doesn't match spec(MX25L25635E), so skip the check below.
         */
        ret = 0;

        if (idBuf[0] != MFGID_MXIC)
        {
            /*
             *  About over 100 instrucsions executed, just want to give
             *  a time-out about 1 seconds to avoid infinite loop
             */
            i32TimeOutCount = (SystemCoreClock) / 100;

            if (isEn)
            {
                while ((i32TimeOutCount-- > 0) && !SPIM_Is4ByteModeEnable(spim, u32NBit)) { }
            }
            else
            {
                while ((i32TimeOutCount-- > 0) && SPIM_Is4ByteModeEnable(spim, u32NBit)) { }
            }

            if (i32TimeOutCount <= 0)
                ret = -1;
        }

        SPIM_SET_DTR_MODE(spim, 0); /* DTR Deactivated. */
    }

    return ret;
}

void SPIM_WinbondUnlock(SPIM_T *spim, uint32_t u32NBit)
{
    uint8_t idBuf[3];
    uint8_t dataBuf[4];

    SPIM_ReadJedecId(spim, idBuf, sizeof(idBuf), u32NBit);

    if ((idBuf[0] != MFGID_WINBOND) || (idBuf[1] != 0x40) || (idBuf[2] != 0x16))
    {
        SPIM_DBGMSG("SPIM_WinbondUnlock - Not W25Q32, do nothing.\n");
        return;
    }

    SPIM_ReadStatusRegister(spim, &dataBuf[0], 1UL, u32NBit);
    SPIM_ReadStatusRegister2(spim, &dataBuf[1], 1UL, u32NBit);
    SPIM_DBGMSG("Status Register: 0x%x - 0x%x\n", dataBuf[0], dataBuf[1]);
    dataBuf[1] &= ~0x40;    /* clear Status Register-1 SEC bit */

    SPIM_Set_Write_Enable(spim, 1, u32NBit);   /* Write Enable.    */
    SPIM_WriteStatusRegister2(spim, dataBuf, sizeof(dataBuf), u32NBit);
    SPIM_Wait_Write_Done(spim, u32NBit);

    SPIM_ReadStatusRegister(spim, &dataBuf[0], 1UL, u32NBit);
    SPIM_ReadStatusRegister2(spim, &dataBuf[1], 1UL, u32NBit);
    SPIM_DBGMSG("Status Register (after unlock): 0x%x - 0x%x\n", dataBuf[0], dataBuf[1]);
}

/**
  * @brief      Erase whole chip.
  * @param      u32NBit     N-bit transmit/receive.
  * @param      isSync      Block or not.
  * @return     None.
  */
void SPIM_ChipErase(SPIM_T *spim, uint32_t u32NBit, int isSync)
{
    uint8_t cmdBuf[] = { OPCODE_CHIP_ERASE };    /* 1-byte Chip Erase command. */

    SPIM_Set_Write_Enable(spim, 1, u32NBit);           /* Write Enable.    */

    SPIM_SET_SS_EN(spim, 1);                          /* CS activated.    */
    SwitchNBitOutput(spim, u32NBit);
    spim_write(spim, cmdBuf, sizeof(cmdBuf));
    SPIM_SET_SS_EN(spim, 0);                          /* CS deactivated.  */

    if (isSync)
    {
        SPIM_Wait_Write_Done(spim, u32NBit);
    }
}

/**
  * @brief      Erase one block.
  * @param      u32Addr         Block to erase which contains the u32Addr.
  * @param      is4ByteAddr     4-byte u32Address or not.
  * @param      u8ErsCmd        Erase command.
  * @param      u32NBit         N-bit transmit/receive.
  * @param      isSync      Block or not.
  * @return     None.
  */
void SPIM_EraseBlock(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr, uint8_t u8ErsCmd, uint32_t u32NBit, int isSync)
{
    uint8_t  cmdBuf[16];
    uint32_t  buf_idx = 0UL;

    SPIM_Set_Write_Enable(spim, 1, u32NBit);           /* Write Enable.    */

    cmdBuf[buf_idx++] = u8ErsCmd;

    if (is4ByteAddr)
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 24);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr & 0xFFUL);
    }
    else
    {
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 16);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr >> 8);
        cmdBuf[buf_idx++] = (uint8_t)(u32Addr & 0xFFUL);
    }

    SPIM_SET_SS_EN(spim, 1);                      /* CS activated.    */
    SwitchNBitOutput(spim, u32NBit);
    spim_write(spim, cmdBuf, buf_idx);
    SPIM_SET_SS_EN(spim, 0);                      /* CS deactivated.  */

    if (isSync)
    {
        SPIM_Wait_Write_Done(spim, u32NBit);
    }
}

/** @cond HIDDEN_SYMBOLS */
/**
 * @brief Swich DMA/DMM Phase Setting Register
 * @param      spim
 * @param u32OPMode SPI Function Operation Mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEWRITE : DMA Write mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEREAD  : DMA Read mode
 *                  - \ref SPIM_CTL0_OPMODE_DIRECTMAP : Direct Memory Mapping mode
 */
static void *SPIM_SwitchPhaseRegister(SPIM_T *spim, uint32_t u32OPMode)
{
    switch (u32OPMode)
    {
        case SPIM_CTL0_OPMODE_PAGEWRITE:
            return (uint32_t *)&spim->PHDMAW;
            break;

        case SPIM_CTL0_OPMODE_PAGEREAD:
            return (uint32_t *)&spim->PHDMAR;
            break;

        case SPIM_CTL0_OPMODE_DIRECTMAP:
            return (uint32_t *)&spim->PHDMM;
            break;
    }

    return NULL;
}

/**
 * @brief Clear DMAW/DMAR/DMM Phase Config
 * @param      spim
 * @param u32OPMode SPI Function Operation Mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEWRITE : DMA Write mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEREAD  : DMA Read mode
 *                  - \ref SPIM_CTL0_OPMODE_DIRECTMAP : Direct Memory Mapping mode
 */
void SPIM_DMAM_ClearPhaseConfig(SPIM_T *spim, uint32_t u32OPMode)
{
    uint32_t *pu32PhaseReg = NULL;

    pu32PhaseReg = (uint32_t *)SPIM_SwitchPhaseRegister(spim, u32OPMode);

    *pu32PhaseReg &= ~(0xFFFFFFFF);    /* clear phase setting. */
}

/**
 * @brief Set DMA/DMM Command Phase
 * @param spim
 * @param u32OPMode SPI Function Operation Mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEWRITE : DMA Write mode
 *                  - \ref SPIM_CTL0_OPMODE_PAGEREAD  : DMA Read mode
 *                  - \ref SPIM_CTL0_OPMODE_DIRECTMAP : Direct Memory Mapping mode
 * @param u32NBit   Command Bit Mode
 *                  - \ref PHASE_NORMAL_MODE : Send Command Use Standard Mode
 *                  - \ref PHASE_DUAL_MODE   : Send Command Use Dual Mode
 *                  - \ref PHASE_QUAD_MODE   : Send Command Use Quad Mode
 *                  - \ref PHASE_OCTAL_MODE  : Send Command Use Octal Mode
 * @param u32Width  Command Width
 *                  - \ref PHASE_WIDTH_8    : Set Command Width 8bit
 *                  - \ref PHASE_WIDTH_16   : Set Command Width 16bit
 *                  - \ref PHASE_WIDTH_24   : Set Command Width 24bit
 *                  - \ref PHASE_WIDTH_32   : Set Command Width 32bit
 * @param u32DTREn  Set Enable/Disable DTR(Double Transfer Rate) Mode 0 or 1
 */
void SPIM_DMAM_SetCmdPhase(SPIM_T *spim, uint32_t u32OPMode, uint32_t u32NBit, uint32_t u32Width, uint32_t u32DTREn)
{
    uint32_t *pu32PhaseReg = NULL;

    pu32PhaseReg = (uint32_t *)SPIM_SwitchPhaseRegister(spim, u32OPMode);

    *pu32PhaseReg &= ~(0xFF);  /* clear Command phase setting. */

