wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
    /* Set DMA/DMM Continue Read Phase */
    SPIM_DMAM_SetContReadPhase(spim,
                               u32OPMode,
                               pPhaseTable->u32RdModePhase,
                               pPhaseTable->u32RdModeWidth,
                               pPhaseTable->u32RdModeDTR);

    if (pPhaseTable->u32RdModeOn == PHASE_READMODE_ON)
    {
        if (u32OPMode == SPIM_CTL0_OPMODE_DIRECTMAP)
        {
            SPIM_DMM_ENABLE_CREN(spim);
        }

        /* Enable Contiue Read Mode */
        SPIM_SET_MODE_DATA(spim, CMD_CONTINUE_READ_MODE);
    }

    if (pPhaseTable->u32DataPhase == PHASE_OCTAL_MODE)
    {
        u32RDQSOn = 1;
    }

    /* Set Flash Data Phase */
    SPIM_DMAM_SetDataPhase(spim,
                           u32OPMode,
                           pPhaseTable->u32DataPhase,
                           pPhaseTable->u32ByteOrder,
                           u32RDQSOn,
                           pPhaseTable->u32DataDTR);

    /* Set Dummy Cycle After Address. */
    if (u32OPMode == SPIM_CTL0_OPMODE_PAGEREAD)
    {
        SPIM_SET_DC_DMAR(spim, pPhaseTable->u32DcNum);
    }
    else if (u32OPMode == SPIM_CTL0_OPMODE_DIRECTMAP)
    {
        SPIM_SET_DC_DMM(spim, pPhaseTable->u32DcNum);
    }
}

int SPIM_FindAndInitDMAMCmdPhase(SPIM_T *spim,
                                 FLASH_CMD_PHASE_T *pPhaseTable,
                                 uint32_t u32TableSize,
                                 uint32_t u32OPMode,
                                 uint32_t u32CMDCode)
{
    uint32_t u32i = 1;
    uint32_t u32found = 0;
    uint32_t u32TableIdx = 0;
    FLASH_CMD_PHASE_T *pTmpTable = NULL;

    for (u32i = 0; u32i < u32TableSize; u32i++)
    {
        /*
         * If element is found in array then raise found flag
         * and terminate from loop.
         */
        if (pPhaseTable[u32i].u32CMDCode == u32CMDCode)
        {
            u32found = 1;
            u32TableIdx = u32i;
            break;
        }
    }

    if (u32found == 0)
    {
        return SPIM_ERR_FAIL;
    }

    pTmpTable = (FLASH_CMD_PHASE_T *)&pPhaseTable[u32TableIdx];

    SPIM_InitDMAMCommandPhase(spim, pTmpTable, u32OPMode);

    return SPIM_OK;
}

/**
 * @brief Calculate I/O phase bit mode size.
 *
 * @param u32Phase
 *          - \ref PHASE_NORMAL_MODE : 1 Bit Mode
 *          - \ref PHASE_DUAL_MODE   : 2 Bit Mode
 *          - \ref PHASE_QUAD_MODE   : 4 Bit Mode
 *          - \ref PHASE_OCTAL_MODE  : 8 Bit Mode
 * @return uint32_t
 */
uint32_t SPIM_GetIOPhaseSize(uint32_t u32Phase)
{
    switch (u32Phase)
    {
        case PHASE_DUAL_MODE:
            return 2;

        case PHASE_QUAD_MODE:
            return 4;

        case PHASE_OCTAL_MODE:
            return 8;

        default:
        case PHASE_NORMAL_MODE:
            return 1;
    }

    return 1;
}

void SPIM_IO_DataPhase(SPIM_T *spim, uint8_t u8TRxBuf[], uint32_t u32TRxSize,
                       uint32_t u32DataPhase, uint32_t u32DTRMode, uint32_t isSync)
{
    //uint8_t u8CmdBuf[1] = {0};

    SPIM_SET_DTR_MODE(spim, u32DTRMode); /* DTR Activated. */
    //SPIM_SET_RDQS_MODE(spim, u32DTRMode);

    if (isSync == 1)
    {
        SwitchNBitOutput(spim, SPIM_GetIOPhaseSize(u32DataPhase));
        spim_write(spim, u8TRxBuf, u32TRxSize);                /* Write out data.  */
    }
    else
    {
        SwitchNBitInput(spim, SPIM_GetIOPhaseSize(u32DataPhase));
        spim_read(spim, u8TRxBuf, u32TRxSize);   /* Read back data.  */
    }

    SPIM_SET_SS_EN(spim, 0);    /* CS Deactivated. */
    SPIM_SET_DTR_MODE(spim, 0); /* DTR Deactivated. */
    SPIM_SET_RDQS_MODE(spim, 0);

    if (isSync)
    {
        SPIM_Wait_Write_Done(spim, u32DataPhase);
    }
}

void SPIM_IO_DCPhase(SPIM_T *spim,
                     uint32_t u32NDummy,
                     uint32_t u32DcPhase,
                     uint32_t u32DTRMode)
{
    uint8_t u8CmdBuf[32] =
    {
        0x55, 0xAA, 0x55, 0xAA, 0x55, 0xAA, 0x55, 0xAA,
        0x55, 0xAA, 0x55, 0xAA, 0x55, 0xAA, 0x55, 0xAA,
        0x55, 0xAA, 0x55, 0xAA, 0x55, 0xAA, 0x55, 0xAA,
        0x55, 0xAA, 0x55, 0xAA, 0x55, 0xAA, 0x55, 0xAA
    };

    if (u32NDummy == 0)
    {
        return;
    }

    SPIM_SET_DTR_MODE(spim, u32DTRMode); /* DTR Activated. */

    SwitchNBitInput(spim, SPIM_GetIOPhaseSize(u32DcPhase));

    /* Same bit mode as above. */
    spim_write(spim, u8CmdBuf, u32NDummy);  /* Write out dummy bytes. */

    SPIM_SET_DTR_MODE(spim, 0); /* DTR Deactivated. */
}

void SPIM_IO_AddrPhase(SPIM_T *spim,
                       uint32_t u32Is4ByteAddr,
                       uint32_t u32Addr,
                       uint32_t u32AddrPhase,
                       uint32_t u32DTRMode)
{
    uint8_t u8CmdBuf[8] = {0};
    uint8_t u8BufIdx = 0;

    SPIM_SET_DTR_MODE(spim, u32DTRMode); /* DTR Activated. */

    if (u32Is4ByteAddr)
    {
        u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 24);
        u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 16);
        u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 8);
        u8CmdBuf[u8BufIdx++] = (uint8_t) u32Addr;

    }
    else
    {
        u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 16);
        u8CmdBuf[u8BufIdx++] = (uint8_t)(u32Addr >> 8);
        u8CmdBuf[u8BufIdx++] = (uint8_t) u32Addr;
    }

    if (((SPIM_GetIOPhaseSize(u32AddrPhase) == 2) ||
            (SPIM_GetIOPhaseSize(u32AddrPhase) == 4)))
    {
        u8BufIdx++;
    }

    SwitchNBitOutput(spim, SPIM_GetIOPhaseSize(u32AddrPhase));
    spim_write(spim, u8CmdBuf, u8BufIdx);  /* Write out u32Address. */

    SPIM_SET_DTR_MODE(spim, 0); /* DTR Deactivated. */
}

void SPIM_IO_CMDPhase(SPIM_T *spim, uint32_t u32RdCMD, uint32_t u32CMDPhase,
                      uint32_t u32DTRMode, uint32_t isSync)
{
    uint8_t u8CmdBuf[2] = {0};
    uint8_t u8CmdSize = 1UL;

    SPIM_SET_DTR_MODE(spim, u32DTRMode); /* DTR Activated. */

    if (isSync == 1)
    {
        SPIM_Set_Write_Enable(spim, 1, SPIM_GetIOPhaseSize(u32CMDPhase));        /* Write Enable.    */
    }

    SPIM_SET_SS_EN(spim, 1);    /* CS activated. */

