wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
    SwitchNBitOutput(spim, u32NBitAddr);
    spim_write(spim, cmdBuf, buf_idx);                 /* Write out u32Address. */

    //buf_idx = 0UL;

    /* Same bit mode as above. */
    //spim_write(spim, cmdBuf, buf_idx);  /* Write out dummy bytes. */

    SwitchNBitInput(spim, u32NBitDat);
    spim_read(spim, pu8RxBuf, u32NRx);  /* Read back data. */

    SPIM_SET_SS_EN(spim, 0);    /* CS deactivated. */
}

/**
  * @brief      Write data to SPI Flash by Page Write mode.
  * @param      u32Addr     Start address to write.
  * @param      is4ByteAddr 4-byte address or not.
  * @param      u32NTx      Number of bytes to write.
  * @param      pu8TxBuf    Transmit buffer.
  * @param      wrCmd       Write command.
  * @return     None.
  */
void SPIM_DMA_Write(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr,
                    uint32_t u32NTx, uint8_t pu8TxBuf[], uint32_t wrCmd)
{
    uint32_t   pageOffset, toWr;
    uint32_t   buf_idx = 0UL;

    /* DTR mode and 16-bit set to dual commands */
    if ((SPIM_GET_PHDMAW_CMD_WIDTH(spim) == PHASE_WIDTH_16) &&
            (SPIM_GET_PHDMAW_CMD_DTR(spim) == 1))
    {
        wrCmd = ((wrCmd << 8) | wrCmd);
    }

    pageOffset = u32Addr % 256UL;

    if ((pageOffset + u32NTx) <= 256UL)
    {
        /* Do all the bytes fit onto one page ? */
        SPIM_WriteInPageDataByPageWrite(spim, u32Addr, is4ByteAddr, u32NTx, pu8TxBuf, wrCmd, 1);
    }
    else
    {
        toWr = 256UL - pageOffset;               /* Size of data remaining on the first page. */

        SPIM_WriteInPageDataByPageWrite(spim, u32Addr, is4ByteAddr, toWr, &pu8TxBuf[buf_idx], wrCmd, 1);

        u32Addr += toWr;                         /* Advance indicator. */
        u32NTx -= toWr;
        buf_idx += toWr;

        while (u32NTx)
        {
            toWr = 256UL;

            if (toWr > u32NTx)
            {
                toWr = u32NTx;
            }

            SPIM_WriteInPageDataByPageWrite(spim, u32Addr, is4ByteAddr, toWr, &pu8TxBuf[buf_idx], wrCmd, 1);

            u32Addr += toWr;                 /* Advance indicator. */
            u32NTx -= toWr;
            buf_idx += toWr;
        }
    }
}

/**
  * @brief      Read data from SPI Flash by Page Read mode.
  * @param      u32Addr     Start address to read.
  * @param      is4ByteAddr 4-byte u32Address or not.
  * @param      u32NRx      Number of bytes to read.
  * @param      pu8RxBuf    Receive buffer.
  * @param      u32RdCmd    Read command.
  * @param      isSync      Block or not.
  * @retval     SPIM_OK          SPIM operation OK.
  * @retval     SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  * @note       This function sets g_SPIM_i32ErrCode to SPIM_TIMEOUT_ERR,
  *             if waiting SPIM time-out.
  */
int SPIM_DMA_Read(SPIM_T *spim, uint32_t u32Addr, int is4ByteAddr,
                  uint32_t u32NRx, uint8_t pu8RxBuf[], uint32_t u32RdCmd, int isSync)
{
    /* DTR mode and 16-bit set to dual commands */
    if ((SPIM_GET_PHDMAR_CMD_WIDTH(spim) == PHASE_WIDTH_16) &&
            (SPIM_GET_PHDMAR_CMD_DTR(spim) == 1))
    {
        u32RdCmd = ((u32RdCmd << 8) | u32RdCmd);
    }

    SPIM_SET_4BYTE_ADDR_EN(spim, is4ByteAddr);          /* Enable/disable 4-Byte Address. */

    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_PAGEREAD);   /* Switch to Page Read mode. */

    SPIM_SET_SPIM_MODE(spim, u32RdCmd);             /* SPIM mode. */

    spim->SRAMADDR = (uint32_t) pu8RxBuf;           /* SRAM u32Address. */
    spim->DMACNT = u32NRx;                          /* Transfer length. */
    spim->FADDR = u32Addr;                          /* Flash u32Address. */

    if (SPIM_IsSPIMENDone(spim, isSync) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
  * @brief      Get Direct Map Address.
  * @param      spim
  * @return     None.
  */
uint32_t SPIM_GetDirectMapAddress(SPIM_T *spim)
{
    uint32_t u32DMMAddr = 0;

    if (spim == SPIM0)
    {
        u32DMMAddr = SPIM0_DMM_MAP_ADDR;
    }
    else if (spim == SPIM1)
    {
        u32DMMAddr = SPIM1_DMM_MAP_ADDR;
    }

    return u32DMMAddr;
}

/**
  * @brief      Enter Direct Map mode.
  * @param      is4ByteAddr     4-byte u32Address or not.
  * @param      u32RdCmd        Read command.
  * @param      u32IdleIntvl    Idle interval.
  * @return     None.
  */
void SPIM_EnterDirectMapMode(SPIM_T *spim, int is4ByteAddr,
                             uint32_t u32RdCmd, uint32_t u32IdleIntvl)
{
    /* DTR mode and 16-bit set to dual commands */
    if ((SPIM_GET_PHDMM_CMD_WIDTH(spim) == PHASE_WIDTH_16) &&
            (SPIM_GET_PHDMM_CMD_DTR(spim) == 1))
    {
        u32RdCmd = ((u32RdCmd << 8) | u32RdCmd);
    }

    SPIM_SET_4BYTE_ADDR_EN(spim, is4ByteAddr);           /* Enable/disable 4-byte u32Address. */
    SPIM_SET_SPIM_MODE(spim, u32RdCmd);                  /* SPIM mode. */
    SPIM_SET_IDL_INTVL(spim, u32IdleIntvl);              /* Idle interval. */
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_DIRECTMAP);   /* Switch to Direct Map mode. */
}

/**
  * @brief      Exit Direct Map mode.
  * @param      spim
  * @return     SPIM_OK          SPIM operation OK.
  *             SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  */
int SPIM_ExitDirectMapMode(SPIM_T *spim)
{
    uint32_t u32CmdBuf = 0xFFFFFFFF;
    spim->TX[0] = u32CmdBuf;

    SPIM_SetQuadEnable(spim, 1, 1);

    SPIM_SET_SS_EN(spim, 1);

    SwitchNBitOutput(spim, 4UL);
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);    /* Switch to Normal mode. */
    SPIM_SET_DATA_WIDTH(spim, 32UL);
    SPIM_SET_BURST_DATA(spim, 1);

    if (SPIM_IsSPIMENDone(spim, 1) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    SPIM_SET_SS_EN(spim, 0);

    SPIM_SetQuadEnable(spim, 0, 1);

    spim->TX[0] = u32CmdBuf;

    SPIM_SET_SS_EN(spim, 1);

    SwitchNBitOutput(spim, 2UL);
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);    /* Switch to Normal mode. */
    SPIM_SET_DATA_WIDTH(spim, 32UL);
    SPIM_SET_BURST_DATA(spim, 1);

    if (SPIM_IsSPIMENDone(spim, 1) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    SPIM_SET_SS_EN(spim, 0);

    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO); /* Switch back to Normal mode.  */

