wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
    return 0;
}

/**
  * @brief      SPIM used to delay the read data strobe (DQS/RWDS) from Octal SPI Flash and Hyper bus device
  * @param      spim
  * @param      u32ClkOnNum Clock Cycle Number between DLL OLDO Enable and DLL Clock Divider Enable
  * @param      u32TrimNum  Clock Cycle Number between DLL Output Valid and DLL Auto Trim Enable
  * @param      u32LKNum    Clock Cycle Number between DLL Clock Divider Enable and DLL Lock
  * @param      u32OVNum    Clock Cycle Number between DLL Lock and DLL Output Valid
  * @param      u32DelayNum DLL Delay Step Number
  * @return     None.
  * @note       First fix DIVIDER to set the frequency of SPIM output bus clock.
  */
void SPIM_CtrlDLLDelayTime(SPIM_T *spim, uint32_t u32ClkOnNum, uint32_t u32TrimNum,
                           uint32_t u32LKNum, uint32_t u32OVNum, uint32_t u32DelayNum)
{
    int i32Timeout = SPIM_TIMEOUT;

    /* The default value of CLKONNUM is 0x07D0 when frequency of DLL reference clock
       is 100 MHz and enable time of DLL clock divider is 20us */
    if (u32ClkOnNum != 0)
    {
        SPIM_SET_DLL2_CLKON_NUM(spim, u32ClkOnNum);
    }

    if (u32TrimNum != 0)
    {
        SPIM_SET_DLL2_TRIM_NUM(spim, u32TrimNum);
    }

    /* The default value of DLLLKNUM is 0x07D0 when frequency of DLL reference clock
       is 100 MHz and DLL lock time is 20us. */
    if (u32LKNum != 0)
    {
        SPIM_SET_DLL1_LOCKK_VALID(spim, u32LKNum);
    }

    if (u32OVNum != 0)
    {
        SPIM_SET_DLL1_OUT_VALID(spim, u32OVNum);
    }

    /* SPIM starts to send DLL reference clock to DLL circuit
       that the frequency is the same as the SPIM output bus clock. */
    SPIM_ENABLE_DLL0_OLDO(spim, 1);

    /* User asserts this control register to 0x1,
       the DLL circuit begins searching for lock with DLL reference clock. */
    SPIM_ENABLE_DLL0_OVRST(spim, 1);

    i32Timeout = SPIM_TIMEOUT;

    /* Polling the DLL status register DLLCKON to 0x1,
       and the value 0x1 indicates that clock divider circuit inside DLL is enabled. */
    while (SPIM_WAIT_DLL0_CLKON(spim) != 1)
    {
        if (i32Timeout-- <= 0)
        {
            break;
        }
    }

    i32Timeout = SPIM_TIMEOUT;

    /* Polling the DLL status register DLLLOCK to 0x1,
       and the value 0x1 indicates that DLL circuit is in lock state */
    while (SPIM_WAIT_DLL0_LOCK(spim) != 1)
    {
        if (i32Timeout-- <= 0)
        {
            break;
        }
    }

    i32Timeout = SPIM_TIMEOUT;

    /* Polling the DLL status register DLLREADY to 0x1,
       and the value 0x1 indicates that output of DLL circuit is ready. */
    while (SPIM_WAIT_DLL0_READY(spim) != 1)
    {
        if (i32Timeout-- <= 0)
        {
            break;
        }
    }

    /* Set this valid delay number to control register DLL_DNUM. */
    SPIM_SET_DLL0_DELAY_NUM(spim, u32DelayNum);

    i32Timeout = SPIM_TIMEOUT;

    /* Polling DLL status register DLL_REF to 1
       to know the updating flow of DLL delay step number is finish or not. */
    while (SPIM_WAIT_DLL0_REFRESH(spim) != 0)
    {
        if (i32Timeout-- <= 0)
        {
            break;
        }
    }
}

//------------------------------------------------------------------------------
// SPIM Hyper Define Function Prototypes
//------------------------------------------------------------------------------
int SPIM_Hyper_IsIdle(SPIM_T *spim)
{
    volatile int32_t i32TimeOutCnt = SPIM_TIMEOUT;

    while (spim->HYPER_CMD != SPIM_HYPER_CMD_IDLE)
    {
        if (i32TimeOutCnt-- <= 0)
        {
            return SPIM_ERR_TIMEOUT;
        }
    }

    return 0;
}

/**
  * @brief      Reset hyper chip function
  * @param      spim
  * @return     SPIM_OK          SPIM operation OK.
  *             SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  * @note       if waiting Hyper Chip time-out.
  */
int SPIM_Hyper_Reset(SPIM_T *spim)
{
    int32_t i32TimeOutCnt = SPIM_TIMEOUT;

    spim->HYPER_CMD = SPIM_HYPER_CMD_RESET;

    if (SPIM_Hyper_IsIdle(spim) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
  * @brief      Exit from Hybrid sleep and deep Power down function
  * @param      spim
  * @return     SPIM_OK          SPIM operation OK.
  *             SPIM_ERR_TIMEOUT SPIM operation abort due to timeout error.
  * @note       This function sets SPIM_ERR_TIMEOUT, if waiting Hyper Chip time-out.
  */
int SPIM_HyperRAM_ExitHSAndDPD(SPIM_T *spim)
{
    int i32TimeOutCnt = SPIM_TIMEOUT;

    spim->HYPER_CMD = SPIM_HYPER_CMD_EXIT_HS_PD;

    if (SPIM_Hyper_IsIdle(spim) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
  * @brief      Read hyper chip register space
  * @param      spim
  * @param[in]  u32Addr  Address of hyper chip register space
  *                 - \ref HYPER_CHIP_ID_REG0       : 0x0000_0000 = Identification Register 0
  *                 - \ref HYPER_CHIP_ID_REG1       : 0x0000_0002 = Identification Register 1
  *                 - \ref HYPER_CHIP_CONFIG_REG0   : 0x0000_1000 = Configuration Register 0
  *                 - \ref HYPER_CHIP_CONFIG_REG1   : 0x0000_1002 = Configuration Register 1
  * @return   The data of hyper chip register.
  * @return   -1  An illeagal register space
  * @return   -2  Wait Hyper Chip time-out
  */
int SPIM_HyperRAM_ReadReg(SPIM_T *spim, uint32_t u32Addr)
{
    int i32TimeOutCnt = SPIM_TIMEOUT;

    if ((u32Addr != HYPER_RAM_ID_REG0) &&
            (u32Addr != HYPER_RAM_ID_REG1) &&
            (u32Addr != HYPER_RAM_CONFIG_REG0) &&
            (u32Addr != HYPER_RAM_CONFIG_REG1))
    {
        return -1;
    }

    spim->HYPER_ADR = u32Addr;

    spim->HYPER_CMD = SPIM_HYPER_CMD_READ_HRAM_REGISTER;

    SPIM_Hyper_IsIdle(spim);

    return (spim->HYPER_RDATA & 0xFFFF);
}

/**
  * @brief      Write Hyper Chip register space
  * @param      spim
  * @param[in]  u32Addr  Address of Hyper Chip register space
  *                 - \ref HYPER_CHIP_ID_REG0       : 0x0000_0000 = Identification Register 0
  *                 - \ref HYPER_CHIP_ID_REG1       : 0x0000_0002 = Identification Register 1
  *                 - \ref HYPER_CHIP_CONFIG_REG0   : 0x0000_1000 = Configuration Register 0
  *                 - \ref HYPER_CHIP_CONFIG_REG1   : 0x0000_1002 = Configuration Register 1
  * @param[in]
  * @return    0  success.
  * @return   -1  An illeagal register space
  * @return   -2  Wait Hyper Chip time-out
  */
int SPIM_HyperRAM_WriteReg(SPIM_T *spim, uint32_t u32Addr, uint32_t u32Value)
{
    int i32TimeOutCnt = SPIM_TIMEOUT;

