wosayttn/M55M1BSP/Library/StdDriver/src/spim.c
    if ((u32Addr != HYPER_RAM_ID_REG0) &&
            (u32Addr != HYPER_RAM_ID_REG1) &
            (u32Addr != HYPER_RAM_CONFIG_REG0) &&
            (u32Addr != HYPER_RAM_CONFIG_REG1))
    {
        return -1;
    }

    spim->HYPER_WDATA &= ~0xFFFFFFFF;

    spim->HYPER_ADR = u32Addr;
    spim->HYPER_WDATA = u32Value;

    spim->HYPER_CMD = SPIM_HYPER_CMD_WRITE_HRAM_REGISTER;

    if (SPIM_Hyper_IsIdle(spim) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
  * @brief      Read 1 word from hyper chip space
  * @param      spim
  * @param[in]  u32Addr  Address of hyper chip space
  * @return     The 16 bit data of hyper chip space.
  * @note       This function sets SPIM_ERR_TIMEOUT if waiting Hyper Chip time-out.
  */
uint16_t SPIM_Hyper_Read1Word(SPIM_T *spim, uint32_t u32Addr)
{
    spim->HYPER_ADR = u32Addr;

    spim->HYPER_CMD = SPIM_HYPER_CMD_READ_1_WORD;

    SPIM_Hyper_IsIdle(spim);

    return (spim->HYPER_RDATA & 0xFFFF);
}

/**
  * @brief      Read 2 word from hyper chip space
  * @param      spim
  * @param[in]  u32Addr  Address of hyper chip space
  * @return     The 32bit data of hyper chip space.
  */
uint32_t SPIM_Hyper_Read2Word(SPIM_T *spim, uint32_t u32Addr)
{
    spim->HYPER_ADR = u32Addr;

    spim->HYPER_CMD = SPIM_HYPER_CMD_READ_2_WORD;

    SPIM_Hyper_IsIdle(spim);

    return spim->HYPER_RDATA;
}

/**
  * @brief      Write 1 byte to hyper chip space
  * @param      spim
  * @param[in]  u32Addr  Address of hyper chip space
  * @param[in]  u8Data   8 bits data to be written to hyper chip space
  * @return     None.
  * @note       This function sets SPIM_ERR_TIMEOUT if waiting Hyper Chip time-out.
  */
int SPIM_Hyper_Write1Byte(SPIM_T *spim, uint32_t u32Addr, uint8_t u8Data)
{
    spim->HYPER_WDATA &= ~0xFFFFFFFF;

    spim->HYPER_ADR = u32Addr;
    spim->HYPER_WDATA = u8Data;

    spim->HYPER_CMD = SPIM_HYPER_CMD_WRITE_1_BYTE;

    if (SPIM_Hyper_IsIdle(spim) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
  * @brief      Write 2 bytes to Hyper Chip space
  * @param      spim
  * @param[in]  u32Addr  Address of Hyper Chip space
  * @param[in]  u16Data  16 bits data to be written to Hyper Chip space
  * @return     None.
  * @note       This function sets SPIM_ERR_TIMEOUT if waiting Hyper Chip time-out.
  */
int SPIM_Hyper_Write2Byte(SPIM_T *spim, uint32_t u32Addr, uint16_t u16Data)
{
    spim->HYPER_WDATA &= ~0xFFFFFFFF;

    spim->HYPER_ADR = u32Addr;
    spim->HYPER_WDATA = u16Data;

    spim->HYPER_CMD = SPIM_HYPER_CMD_WRITE_2_BYTE;

    if (SPIM_Hyper_IsIdle(spim) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
  * @brief      Write 3 bytes to Hyper Chip space
  * @param      spim
  * @param[in]  u32Addr  Address of Hyper Chip space
  * @param[in]  u32Data  24 bits data to be written to Hyper Chip space
  * @return     None.
  * @note       This function sets SPIM_ERR_TIMEOUT if waiting Hyper Chip time-out.
  */
int SPIM_Hyper_Write3Byte(SPIM_T *spim, uint32_t u32Addr, uint32_t u32Data)
{
    spim->HYPER_WDATA &= ~0xFFFFFFFF;

    spim->HYPER_ADR = u32Addr;
    spim->HYPER_WDATA = u32Data;

    spim->HYPER_CMD = SPIM_HYPER_CMD_WRITE_3_BYTE;

    if (SPIM_Hyper_IsIdle(spim) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
  * @brief      Write 4 byte to hyper chip space
  * @param      spim
  * @param[in]  u32Addr  Address of hyper chip space
  * @param[in]  u32Data  32 bits data to be written to hyper chip space
  * @return     None.
  * @note       This function sets SPIM_ERR_TIMEOUT if waiting Hyper Chip time-out.
  */
int SPIM_Hyper_Write4Byte(SPIM_T *spim, uint32_t u32Addr, uint32_t u32Data)
{
    spim->HYPER_WDATA &= ~0xFFFFFFFF;

    spim->HYPER_ADR = u32Addr;
    spim->HYPER_WDATA = u32Data;

    spim->HYPER_CMD = SPIM_HYPER_CMD_WRITE_4_BYTE;

    if (SPIM_Hyper_IsIdle(spim) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
  * @brief      SPIM Config HyperBus Access Module Parameter
  * @param      spim
  * @param      u32CSMaxLT Chip Select Maximum Low Time
  * @param      u32AcctRD Initial Read Access Time
  * @param      u32AcctWR Initial Write Access Time
  * @return     None.
  * @note       This function sets g_SPIM_Hyper_i32ErrCode to SPIM_ERR_TIMEOUT if waiting Hyper Chip time-out.
  */
void SPIM_Hyper_Config(SPIM_T *spim, uint32_t u32CSMaxLow, uint32_t u32AcctRD, uint32_t u32AcctWR)
{
    /* Chip Select Setup Time 2.5 */
    SPIM_HYPER_CONFIG1_SET_CSST(spim, SPIM_HYPER_CONFIG1_CSST_2_5_HCLK);

    /* Burst Group Size 32Bits */
    //SPIM_HYPER_CONFIG1_SET_BGSIZE(spim, u32BSize);

    /* Chip Select Hold Time 2.5 HCLK */
    SPIM_HYPER_CONFIG1_SET_CSH(spim, SPIM_HYPER_CONFIG1_CSH_2_5_HCLK);

    /* Chip Select High between Transaction as 1 HCLK cycles */
    SPIM_HYPER_CONFIG1_SET_CSHI(spim, 2);

    /* Chip Select Masximum low time 71 HCLK */
    SPIM_HYPER_CONFIG1_SET_CSMAXLT(spim, u32CSMaxLow);

    /* Initial Device RESETN Low Time 0 */
    SPIM_HYPER_CONFIG2_SET_RSTNLT(spim, 0xFF);

    /* Initial Access Time 7 Clock cycle*/
    SPIM_HYPER_CONFIG2_SET_ACCTRD(spim, u32AcctRD);

    SPIM_HYPER_CONFIG2_SET_ACCTWR(spim, u32AcctWR);

    //spim->HYPER_CONFIG2 = (spim->HYPER_CONFIG2 & 0xFF00FFFF) | 0x00700000;
}

/**
  * @brief      Write data to HyperBus Module.
  * @param      u32Addr Start address to write.
  * @param      pvWrBuf Transmit buffer.
  * @param      u32NTx  Number of bytes to write.
  * @return     None.
  */
int SPIM_Hyper_DMAWrite(SPIM_T *spim, uint32_t u32Addr, void *pvWrBuf, uint32_t u32NTx)
{
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_PAGEWRITE);  /* Switch to DMA Write mode.   */

    spim->SRAMADDR = (uint32_t) pvWrBuf;                /* SRAM u32Address.  */
    spim->DMACNT = u32NTx;                              /* Transfer length.  */
    spim->FADDR = u32Addr;                              /* Flash u32Address. */

    if (SPIM_IsSPIMENDone(spim, 1) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
  * @brief      Read data from HyperBus Module.
  * @param      u32Addr Start address to read.
  * @param      pvRdBuf Receive buffer.
  * @param      u32NRx  Number of bytes to read.
  * @return     None.
  */
int SPIM_Hyper_DMARead(SPIM_T *spim, uint32_t u32Addr, void *pvRdBuf, uint32_t u32NRx)
{
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_PAGEREAD);   /* Switch to DMA Write mode.   */

    spim->SRAMADDR = (uint32_t) pvRdBuf;                /* SRAM u32Address. */
    spim->DMACNT = u32NRx;                              /* Transfer length. */
    spim->FADDR = u32Addr;                              /* Flash u32Address. */

    if (SPIM_IsSPIMENDone(spim, 1) == SPIM_ERR_TIMEOUT)
    {
        return SPIM_ERR_TIMEOUT;
    }

    return SPIM_OK;
}

/**
  * @brief      SPIM Hyper Mode Enter DMM Mode
  * @param      spim
  * @return     None.
  * @note       This function sets SPIM_ERR_TIMEOUT if waiting Hyper Chip time-out.
  */
int SPIM_Hyper_EnterDirectMapMode(SPIM_T *spim)
{
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_DIRECTMAP);  /* Switch to DMA Write mode.   */

    return SPIM_OK;
}

/**
  * @brief      SPIM Hyper Mode Exit DMM Mode
  * @param      spim
  * @return     None.
  * @note       This function sets SPIM_ERR_TIMEOUT if waiting Hyper Chip time-out.
  */
void SPIM_Hyper_ExitDirectMapMode(SPIM_T *spim)
{
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);       /* Switch back to Normal mode.  */
}

/**
  * @brief      SPIM Hyper Mode Exit DMM Mode
  * @param      spim
  * @return     None.
  * @note       This function sets SPIM_ERR_TIMEOUT if waiting Hyper Chip time-out.
  */
int SPIM_Hyper_IsDMMDone(SPIM_T *spim)
{
    uint32_t u32TimeOutCount = SPIM_TIMEOUT;

    SPIM_DMM_HYPDONE(spim);       /* HyperBus DMM Mode Done.  */

    while (SPIM_WAIT_HYPDONE(spim))
    {
        if (--u32TimeOutCount == 0)
        {
            return SPIM_ERR_TIMEOUT;
        }
    }

    return SPIM_OK;
}

/** @} end of group SPIM_EXPORTED_FUNCTIONS */
/** @} end of group SPIM_Driver */
/** @} end of group Standard_Driver */
